src/research.org
#+TITLE: Research
#+OPTIONS: toc:nil num:nil title:nil

* Research Interests

- Secure computation primitives and protocols: OT, VOLE, PSI, etc.
- Foundations of cryptography
- Privacy-preserving machine learning

* Publications

- *FedPAB: Federated Medical Image Segmentation with Personalized Attention and Boundary-oriented Learning*\\
  Xinyv Li, Cen Chen, /Jamie Cui/\\
  BIBM 2024, [[https://www.computer.org/csdl/proceedings-article/bibm/2024/10822730/23oodSdqIbC][link]]

- *Online-Efficient Secure Logistic Regression based on Function Secret Sharing*\\
  Jing Liu, /Jamie Cui/, Cen Chen @@html:/* Co-first-author */@@\\
  CIKM 2023, [[https://arxiv.org/abs/2309.09486?context=cs][eprint]]

- *Robust Clustered Federated Learning*\\
  Tiandi Ye, Senhui Wei, /Jamie Cui/, Cen Chen, Yingnan Fu, Ming Gao\\
  DASFAA 2023, [[https://dl.acm.org/doi/abs/10.1007/978-3-031-30637-2_45][link]]

- *A Customized Text Sanitization Mechanism with Differential Privacy*\\
  Sai Chen, Fengran Mo, Yanhao Wang, Cen Chen, Jian-Yun Nie, Chengyu Wang, /Jamie Cui/\\
  ACL 2023, [[https://arxiv.org/abs/2207.01193][eprint]]

- *Exploiting Data Sparsity in Secure Cross-Platform Social Recommendation*\\
  /Jamie Cui/, Chaochao Chen, Lingjuan Lyu, Carl Yang, Wang Li\\
  NeurIPS 2021, [[https://arxiv.org/abs/2202.07253][eprint]]

- *Privacy-Preserving Computation over Genetic Data: HLA Matching and so on*\\
  /Jinming Cui/, Huaping Li, Meng Yang\\
  IJCAI 2019 workshop, [[https://eprint.iacr.org/2019/1305][eprint]]
