research/index.html
<!DOCTYPE html>
<html lang="en-US">
  <head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Research - Jamie Cui</title>
    <link rel="icon" type="image/svg+xml" href="/favicon.svg">
    <link rel="stylesheet" href="/site.css">
  </head>
  <body>
    <header>
      <h1><a href="/">Jamie Cui</a></h1>
      <p class="subtitle">Research</p>
    </header>


    <nav class="tags" aria-label="Sections">
      <a class="tag" href="/">Home</a>
      <a class="tag" href="/research/">Research</a>
      <a class="tag" href="/blogs/">Blogs</a>
      <a class="tag" href="/paper-feeds/">Paper Feeds</a>
    </nav>

    <main>
      <div class="outline-2">
      <h2>Research Interests</h2>
      <div class="outline-text-2">
      <ul class="org-ul">
      <li>Secure computation primitives and protocols: OT, VOLE, PSI, etc.</li>
      <li>Foundations of cryptography</li>
      <li>Privacy-preserving machine learning</li>
      </ul>
      </div>
      </div>

      <div class="outline-2">
      <h2>Publications</h2>
      <div class="outline-text-2">
      <ul class="org-ul">
      <li><b>FedPAB: Federated Medical Image Segmentation with Personalized Attention and Boundary-oriented Learning</b><br />
      Xinyv Li, Cen Chen, <i>Jamie Cui</i><br />
      BIBM 2024, <a href="https://www.computer.org/csdl/proceedings-article/bibm/2024/10822730/23oodSdqIbC">link</a></li>

      <li><b>Online-Efficient Secure Logistic Regression based on Function Secret Sharing</b><br />
      Jing Liu, <i>Jamie Cui</i>, Cen Chen /* Co-first-author */<br />
      CIKM 2023, <a href="https://arxiv.org/abs/2309.09486?context=cs">eprint</a></li>

      <li><b>Robust Clustered Federated Learning</b><br />
      Tiandi Ye, Senhui Wei, <i>Jamie Cui</i>, Cen Chen, Yingnan Fu, Ming Gao<br />
      DASFAA 2023, <a href="https://dl.acm.org/doi/abs/10.1007/978-3-031-30637-2_45">link</a></li>

      <li><b>A Customized Text Sanitization Mechanism with Differential Privacy</b><br />
      Sai Chen, Fengran Mo, Yanhao Wang, Cen Chen, Jian-Yun Nie, Chengyu Wang, <i>Jamie Cui</i><br />
      ACL 2023, <a href="https://arxiv.org/abs/2207.01193">eprint</a></li>

      <li><b>Exploiting Data Sparsity in Secure Cross-Platform Social Recommendation</b><br />
      <i>Jamie Cui</i>, Chaochao Chen, Lingjuan Lyu, Carl Yang, Wang Li<br />
      NeurIPS 2021, <a href="https://arxiv.org/abs/2202.07253">eprint</a></li>

      <li><b>Privacy-Preserving Computation over Genetic Data: HLA Matching and so on</b><br />
      <i>Jinming Cui</i>, Huaping Li, Meng Yang<br />
      IJCAI 2019 workshop, <a href="https://eprint.iacr.org/2019/1305">eprint</a></li>
      </ul>
      </div>
      </div>

    </main>

    <footer>
      <p>It is possible to build a cabin with no foundations, but not a lasting building.</p>
    </footer>
  </body>
</html>
